benchmarks/results/after_redis_match_2026-04-02.txt

Summary:
  Total:	4.7037 secs
  Slowest:	1.0293 secs
  Fastest:	0.0906 secs
  Average:	0.1797 secs
  Requests/sec:	106.2989
  

Response time histogram:
  0.091 [1]	|
  0.184 [378]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.278 [67]	|■■■■■■■
  0.372 [6]	|■
  0.466 [0]	|
  0.560 [24]	|■■■
  0.654 [12]	|■
  0.748 [0]	|
  0.842 [3]	|
  0.935 [1]	|
  1.029 [8]	|■


Latency distribution:
  10%% in 0.1007 secs
  25%% in 0.1051 secs
  50%% in 0.1168 secs
  75%% in 0.1813 secs
  90%% in 0.3205 secs
  95%% in 0.5597 secs
  99%% in 1.0167 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0037 secs, 0.0000 secs, 0.0961 secs
  DNS-lookup:	0.0015 secs, 0.0000 secs, 0.0383 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0021 secs
  resp wait:	0.1753 secs, 0.0903 secs, 1.0289 secs
  resp read:	0.0004 secs, 0.0000 secs, 0.0057 secs

Status code distribution:
  [200]	100 responses
  [429]	400 responses