benchmarks/results/after_redis_profile_2026-04-02.txt

Summary:
  Total:	3.7265 secs
  Slowest:	0.3610 secs
  Fastest:	0.0882 secs
  Average:	0.1151 secs
  Requests/sec:	80.5041
  

Response time histogram:
  0.088 [1]	|
  0.115 [178]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.143 [100]	|■■■■■■■■■■■■■■■■■■■■■■
  0.170 [11]	|■■
  0.197 [4]	|■
  0.225 [0]	|
  0.252 [0]	|
  0.279 [1]	|
  0.306 [2]	|
  0.334 [0]	|
  0.361 [3]	|■


Latency distribution:
  10%% in 0.0931 secs
  25%% in 0.0982 secs
  50%% in 0.1110 secs
  75%% in 0.1190 secs
  90%% in 0.1249 secs
  95%% in 0.1573 secs
  99%% in 0.3489 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0020 secs, 0.0000 secs, 0.0659 secs
  DNS-lookup:	0.0003 secs, 0.0000 secs, 0.0081 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.1126 secs, 0.0880 secs, 0.2964 secs
  resp read:	0.0003 secs, 0.0001 secs, 0.0300 secs

Status code distribution:
  [429]	300 responses