benchmarks/results/after_redis_ride_detail_2026-04-02.txt

Summary:
  Total:	3.7378 secs
  Slowest:	0.3425 secs
  Fastest:	0.0885 secs
  Average:	0.1154 secs
  Requests/sec:	80.2602
  

Response time histogram:
  0.088 [1]	|
  0.114 [180]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.139 [103]	|■■■■■■■■■■■■■■■■■■■■■■■
  0.165 [1]	|
  0.190 [4]	|■
  0.215 [2]	|
  0.241 [0]	|
  0.266 [0]	|
  0.292 [2]	|
  0.317 [3]	|■
  0.342 [4]	|■


Latency distribution:
  10%% in 0.0945 secs
  25%% in 0.0995 secs
  50%% in 0.1063 secs
  75%% in 0.1173 secs
  90%% in 0.1257 secs
  95%% in 0.1707 secs
  99%% in 0.3383 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0020 secs, 0.0000 secs, 0.0677 secs
  DNS-lookup:	0.0002 secs, 0.0000 secs, 0.0076 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0008 secs
  resp wait:	0.1131 secs, 0.0880 secs, 0.3278 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.0080 secs

Status code distribution:
  [200]	100 responses
  [429]	200 responses